---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.AirSystemData.AirFanType
source: html/1fef24a6-6891-d294-fdea-f2a38a6890e6.htm
---
# Autodesk.Revit.DB.Mechanical.AirSystemData.AirFanType Property

The fan type.

## Syntax (C#)
```csharp
public AirFanType AirFanType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration